[
    {
        "client_msg_id": "c14c59d9-0618-4e8d-8eee-53bf841c3e38",
        "type": "message",
        "text": "I partnered with Common Room’s Uncommon community to share the ‘why’ and four simple ‘hows’ for creating more welcoming community spaces and encouraging more diversity, equity, and inclusion (DEI) across communities:\n\n1. Personalize the onboarding process\n2. Be intentional about access to your community\n3. Create sub-groups for underrepresented individuals\n4. Research holidays and special days that represent meaning to marginalized people\n\nHere’s the blog post - <https:\/\/www.commonroom.io\/blog\/dei-in-your-community-it-s-more-about-contribution-than-attendance\/|DEI in your community: It’s more about contribution than attendance | Common Room>\n\nHere’s the video of  each point explained  - <https:\/\/youtu.be\/UFzEE7ILPFU>",
        "user": "U01K9FN40KS",
        "ts": "1648123084.033739",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "gae03338b93f",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/ae03338b93f26a2ba7dc418713bb8023.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0025-72.png",
            "first_name": "",
            "real_name": "Jephtah abu",
            "display_name": "Jephtah abu",
            "team": "TJE58GTJL",
            "name": "jephtahabu",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/www.commonroom.io\/blog\/dei-in-your-community-it-s-more-about-contribution-than-attendance\/",
                "thumb_url": "https:\/\/cdn.sanity.io\/images\/vt347z5x\/production\/81c9ab2d0ebdbbc9f89917d345a6a9ba5eca6e1b-2246x1262.png?w=1536",
                "thumb_width": 1536,
                "thumb_height": 863,
                "service_icon": "https:\/\/www.commonroom.io\/static\/meta\/apple-touch-icon.png",
                "id": 1,
                "original_url": "https:\/\/www.commonroom.io\/blog\/dei-in-your-community-it-s-more-about-contribution-than-attendance\/",
                "fallback": "Common Room: DEI in your community: It’s more about contribution than attendance | Common Room",
                "text": "Community consultant Jephtah Abu partnered with Common Room's Uncommon community to share the 'why' and four simple 'hows' for creating more welcoming community spaces and encouraging more diversity, equity, and inclusion (DEI) across communities: Personalize the onboarding process, be intentional about access to your community, create sub-groups for underrepresented individuals, and research holidays and special days that represent meaning to marginalized people.",
                "title": "DEI in your community: It’s more about contribution than attendance | Common Room",
                "title_link": "https:\/\/www.commonroom.io\/blog\/dei-in-your-community-it-s-more-about-contribution-than-attendance\/",
                "service_name": "Common Room"
            },
            {
                "from_url": "https:\/\/youtu.be\/UFzEE7ILPFU",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/UFzEE7ILPFU\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/UFzEE7ILPFU?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/youtube.png",
                "id": 2,
                "original_url": "https:\/\/youtu.be\/UFzEE7ILPFU",
                "fallback": "YouTube Video: DEI in your community: Community consultant Jephtah Abu shares four simple ways to increase DEI",
                "title": "DEI in your community: Community consultant Jephtah Abu shares four simple ways to increase DEI",
                "title_link": "https:\/\/youtu.be\/UFzEE7ILPFU",
                "author_name": "Common Room — The Community Intelligence Platform",
                "author_link": "https:\/\/www.youtube.com\/channel\/UC1YQ7n_u0Vt4XieANHNuJgw",
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "BDwQ",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "I partnered with Common Room’s Uncommon community to share the ‘why’ and four simple ‘hows’ for creating more welcoming community spaces and encouraging more diversity, equity, and inclusion (DEI) across communities:\n\n1. Personalize the onboarding process\n2. Be intentional about access to your community\n3. Create sub-groups for underrepresented individuals\n4. Research holidays and special days that represent meaning to marginalized people\n\nHere’s the blog post - "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.commonroom.io\/blog\/dei-in-your-community-it-s-more-about-contribution-than-attendance\/",
                                "text": "DEI in your community: It’s more about contribution than attendance | Common Room"
                            },
                            {
                                "type": "text",
                                "text": "\n\nHere’s the video of  each point explained  - "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/youtu.be\/UFzEE7ILPFU"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "client_msg_id": "c082f94d-8560-45ed-bd9c-82a551d9042d",
        "type": "message",
        "text": "I’m more comfortable behind the keyboard but over the last year it has been really fun to push outside that comfort zone.\n\nFirst with a podcast that we also <https:\/\/youtu.be\/rkM0Xpq0BIc|publish as a video> and last week I even tried my hand at acting and voice-over for <https:\/\/youtu.be\/o2eT0tHjtxI|our latest ad>.\n\nSo yeah, it’s a promo, but it’s also a message to keep trying new creative directions, keep things fresh, and find a team that’s willing to experiment. Enjoy the ride :v:",
        "user": "U027N1Z9ZBJ",
        "ts": "1648123889.014469",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "8744c6873488",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-07-05\/2247336152260_8744c6873488b4b6897f_72.jpg",
            "first_name": "John",
            "real_name": "John McTavish",
            "display_name": "John McTavish",
            "team": "TJE58GTJL",
            "name": "j.mctav23",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/youtu.be\/o2eT0tHjtxI",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/o2eT0tHjtxI\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/o2eT0tHjtxI?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/youtube.png",
                "id": 1,
                "original_url": "https:\/\/youtu.be\/o2eT0tHjtxI",
                "fallback": "YouTube Video: Meet your future at the Paralect Accelerator",
                "title": "Meet your future at the Paralect Accelerator",
                "title_link": "https:\/\/youtu.be\/o2eT0tHjtxI",
                "author_name": "Paralect",
                "author_link": "https:\/\/www.youtube.com\/c\/Paralect",
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "\/B7",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "I’m more comfortable behind the keyboard but over the last year it has been really fun to push outside that comfort zone.\n\nFirst with a podcast that we also "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/youtu.be\/rkM0Xpq0BIc",
                                "text": "publish as a video"
                            },
                            {
                                "type": "text",
                                "text": " and last week I even tried my hand at acting and voice-over for "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/youtu.be\/o2eT0tHjtxI",
                                "text": "our latest ad"
                            },
                            {
                                "type": "text",
                                "text": ".\n\nSo yeah, it’s a promo, but it’s also a message to keep trying new creative directions, keep things fresh, and find a team that’s willing to experiment. Enjoy the ride "
                            },
                            {
                                "type": "emoji",
                                "name": "v"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "client_msg_id": "cdc4e43f-82fc-45df-b55c-04ec981da6f8",
        "type": "message",
        "text": "You’ve got talent, but do you have a content strategy? Lots of great writers and marketers simply never learned the fundamentals.\n\nSo we created an educational course: Content Strategy Quickstart.\nKick off your own B2B content strategy in about 6 hours.\n<https:\/\/csq.gumroad.com\/l\/content-strategy-quickstart>",
        "user": "U019Y01L1TQ",
        "ts": "1648149654.274949",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "3cd4a7e94f00",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-12-22\/1600380669844_3cd4a7e94f00c2a1d1d4_72.png",
            "first_name": "Josh",
            "real_name": "Josh Orr",
            "display_name": "Josh Orr",
            "team": "TJE58GTJL",
            "name": "josh068",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/csq.gumroad.com\/l\/content-strategy-quickstart",
                "image_url": "https:\/\/public-files.gumroad.com\/variants\/8so6m0hyo2ab9a49tmcec2dilej4\/baaca0eb0e33dc4f9d45910b8c86623f0144cea0fe0c2093c546d17d535752eb",
                "image_width": 533,
                "image_height": 250,
                "image_bytes": 44294,
                "id": 1,
                "original_url": "https:\/\/csq.gumroad.com\/l\/content-strategy-quickstart",
                "fallback": "Gumroad: Content Strategy Quickstart",
                "text": "It stinks to be on the content hamster wheel. You churn out whatever content you can. Rush, publish, repeat. Results are lackluster (and honestly, you’re probably just contributing to the noise).But you’re a smart, driven marketer—this content thing shouldn’t be so hard!This course gives you the foundation you need to become the strategic content marketer that makes a real impact for the <http:\/\/business.In|business.In> just a few hours, this course will teach you how to create a B2B content strategy you can put to work right away. Step by step, with tons of details (we’re creating a new standard for the word “actionable” here).This course will help you if you’re a:Content marketer who feels like you’re just churning out whatever you can, but without a strategySmall marketing team trying to get a content engine going—and spinning your wheels in the meantimeFreelancer who wants to help your clients get more out of their content marketingYou’ll learn:What you need to know about your target audience—and how to find the infoHow to prioritize themes and topics for your contentHow to align your content to different stages of the buyer’s journeyHow to tell if any of your campaigns are actually workingHow to transition from strategy to content creationAnd when you’re finished, you’ll have:A complete content strategy document to guide your content productionA full editorial calendar, ready for you to executeConfidence you’re doing this content thing rightTestimonials\"This small group of content experts have put together a no-nonsense, uber practical guide to getting started with content strategy and planning. They include everything you'd need to start from 0 — and everything you likely could be using to take a step back and ask yourself if you're doing content strategy the right way.\" “Building a B2B content strategy from scratch can be overwhelming. Where should you even start? What areas should you focus on? How should you measure success? This course starts with the one thing that matters most in marketing—understanding your customer. From there, it shares the actionable tips and insights you’ll need to get your team aligned and moving in the right direction.”SyllabusLesson 1: Identify Your AudienceThe key pieces of a content personaDocumenting your personas in a matrixWhere to find persona insightsAssignment: Fill out customer personas templateLesson 2: Build Your Topic StrategyWhat do we mean by “topic strategy”?Generating topic ideasDetermining &amp; scoring keyword relevanceGetting volume and competition data Understanding your topic strategyAssignment: Finalize topic strategyKoala Break :koala:Lesson 3: Align Content to the Buyer’s JourneyThe simplest way to understand the buyer’s journeyWhat buyers are trying to accomplish at each stageHow to break topics down by journey stage Assignment: Fill in your buyer’s journey templateLesson 4: Plan and ScheduleComponents of a content trackerHow to populate and use your content trackerAssignment: Complete your content trackerLesson 5: Measure PerformanceWhat are KPIs?Choosing the right KPIs for your content programHow to use common tools to measure each KPI Assignment: Complete your KPI templateBuild a Praise Jar :raised_hands:FAQsWho is this course for?Anyone who’s feeling overwhelmed and undervalued when it comes to their content marketing efforts. This course will give you the foundation you need to create B2B content in a more strategic, customer-centric, and effective manner. It’s a great resource for marketers and writers who need or want to take ownership of the strategy side of content marketing (in-house or for clients). It’s also a great course for any content owner who feels intimidated by the technical side of SEO.Who is this course NOT for?Experienced B2B content marketing strategists. This is an introductory course that teaches the fundamentals of getting up and running with a data-informed B2B content strategy. If you’ve already nailed those skills, you may want a more advanced course.What will I learn in this course?You’ll learn exactly what needs to be in your content strategy, how to assemble it, and how to translate this information into individual content pieces to populate your calendar. You’ll learn, step-by-step:How to find and document the right audience insightsHow to use search data to prioritize your topicsHow to break topics down into content pieces aligned to the buyer’s journeyHow to measure your performance, depending on your content maturity How to transition from strategy and planning to content productionWhat can I expect to walk away with?A full content strategy document that you can present to your wider team or your client to guide content production. In each lesson, we’ll walk you through one section of the content strategy workbook. By the end, you’ll have a complete strategy document—from audience personas to content <http:\/\/calendar.Is|calendar.Is> this course worth it?It’s a steal when you consider we sell these kinds of strategies to clients for $5,000 to $7,500. If you’re an in-house marketer, you’ll quickly recoup your costs in efficiency and performance (stop paying for blog posts that don’t perform!). If you’re a freelancer, you can recoup the expenses (and then some) with a single content strategy gig.What else should I know?We’re very nice and can be pretty funny sometimes, too. But the goofy kind of funny. And a tad weird. Mmmmk?A Bit About UsNicole has been a writer since the first grade—when she plagiarized her first book.Thankfully, first grade is fairly forgiving, and no harm came from submitting Little Bear as her own in the young author competition.Nicole has since learned the value of reliably producing high quality original content. For the past 8+ years, she has been helping B2B brands like Epsilon, Harte Hanks, FullContact, Strategyn, and ETQ get strategic with their content—to build audiences and drive demand. She now provides fractional content director services for marketers who are ready to stop spinning their wheels and make a real impact through content marketing. Justin started his career in a strange place—finance—after spending most of college reading Latin and Greek. Through participation in a series of obscure hobbies, Justin eventually found himself in a succession of marketing jobs at companies including MongoDB, GitHub, and Dremio. Frustrated with how hard SEO and content performance is for marketers, Justin decided to put his spreadsheet and data skills to use to help writers and content marketers feel more confident in what they’re producing, and why.Justin is now a partner at Ercule, a full-stack agency with a focus on SEO and content performance. Ercule uses data, process, and code to help content marketers drive revenue. Josh is a seasoned content creator who’s newer to the world of content marketing – which made him the perfect person to support us with writing and production for this course.Before joining up with the Ercule agency in 2019, Josh spent more than a decade creating written and video content for a wide range of clients. He’s produced digital comedy for Microsoft, animation for Universal, journalism for New York Times Co., and documentary video for numerous nonprofit organizations.",
                "title": "Content Strategy Quickstart",
                "title_link": "https:\/\/csq.gumroad.com\/l\/content-strategy-quickstart",
                "service_name": "Gumroad"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "jW1",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "You’ve got talent, but do you have a content strategy? Lots of great writers and marketers simply never learned the fundamentals.\n\nSo we created an educational course: Content Strategy Quickstart.\nKick off your own B2B content strategy in about 6 hours.\n"
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/csq.gumroad.com\/l\/content-strategy-quickstart"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]