[
    {
        "client_msg_id": "d9f8e404-5689-4db1-be7b-e8423fdc453b",
        "type": "message",
        "text": "clarifying that it isn't a sales enablement role is a great point and super helpful!\n\nThe data content marketer actually would have their own campaigns! This is unique from a marketing ops type role (which we are lucky to have!) that analyzes our campaigns data. This is someone who creates lead gen data reports like this one that we do with data from our software platform! <https:\/\/www.quorum.us\/reports\/report-lawmakers-news\/> This content drives seo traffic, press links, and (when we occasionally gate them) new leads! But the reports are a lot of work and could be a lot more engaging and insightful with someone with a data\/statistics background in addition to content marketing.",
        "user": "U01ANAZTZTK",
        "ts": "1625576677.182100",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "ef5727669c45",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-09-08\/1349771386962_ef5727669c45c9f60612_72.jpg",
            "first_name": "Theresa",
            "real_name": "Theresa Hebert",
            "display_name": "Theresa Hebert",
            "team": "TJE58GTJL",
            "name": "theresa",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Quorum",
                "title": "Report: The Average Congressional Democrat is Mentioned in the News 47% More Often Than the Average Republican",
                "title_link": "https:\/\/www.quorum.us\/reports\/report-lawmakers-news\/",
                "text": "We used Quorum News, our news monitoring product to identify which types of outlets cite members the most, how local coverage differs from national news, and which lawmakers make the most of various types of media such as traditional print and broadcast, blogs, and podcasts.  ",
                "fallback": "Quorum: Report: The Average Congressional Democrat is Mentioned in the News 47% More Often Than the Average Republican",
                "thumb_url": "https:\/\/www.quorum.us\/wp-content\/uploads\/2020\/09\/shutterstock_257412721.jpg",
                "from_url": "https:\/\/www.quorum.us\/reports\/report-lawmakers-news\/",
                "thumb_width": 1500,
                "thumb_height": 1000,
                "service_icon": "https:\/\/www.quorum.us\/wp-content\/themes\/Quorum-Theme\/dist\/images\/favicons\/apple-touch-icon.png",
                "id": 1,
                "original_url": "https:\/\/www.quorum.us\/reports\/report-lawmakers-news\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "IaZQ",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "clarifying that it isn't a sales enablement role is a great point and super helpful!\n\nThe data content marketer actually would have their own campaigns! This is unique from a marketing ops type role (which we are lucky to have!) that analyzes our campaigns data. This is someone who creates lead gen data reports like this one that we do with data from our software platform! "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.quorum.us\/reports\/report-lawmakers-news\/"
                            },
                            {
                                "type": "text",
                                "text": " This content drives seo traffic, press links, and (when we occasionally gate them) new leads! But the reports are a lot of work and could be a lot more engaging and insightful with someone with a data\/statistics background in addition to content marketing."
                            }
                        ]
                    }
                ]
            }
        ],
        "thread_ts": "1625171810.177800",
        "parent_user_id": "U01ANAZTZTK",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U01L7S9J4KE"
                ],
                "count": 1
            }
        ]
    }
]