[
    {
        "client_msg_id": "68c4baf5-90a0-4673-96ac-06d95c7573ee",
        "type": "message",
        "text": "At various times throughout our career we hit these points where we become \"more strategic\", by that I mean, we begin taking greater ownership of answering the question: \"What should I do?\" or \"What are the 1-3 things I can do right now that will have the biggest impact on the business?\" That question changes based on your role, but it's always a bit unnerving to encounter it :slightly_smiling_face: So all that to say, I think what you're feeling is very normal and it can be scary to not know the path forward. There are a few tried and true things I turn to when I find myself asking that question:\n1. Talk to your \"customer\" -- this is to <@UJDPMTREY>'s point. At different times my \"customer\" has been sales, my VP, or the CEO. Who is the person who has a marketing job-to-be-done? Doing this well helped me become a more strategic individual contributor.\n\n2. Talk to people in similar roles -- This is a freaking superpower and marketers are so willing to share. Whenever I feel stuck, I start scheduling calls with people I think are smart or are doing cool things. It is incredibly powerful and something I am trying to build a habit around rather than just doing it when I need answers right now.\n\nFor you, it might be helpful to talk to marketers in growth marketing roles. That tends to be where you find more technical marketers and it could uncover some things for you. Talking to marketers I admire has done so much to make me a better tactical marketer, but also take ownership over my career and make important decisions about how I want to develop.\n\n3.  Talk to your actual business customer -- When marketers make the jump from individual contributor to leader (whether that is leading a team or just making more strategic biz decisions), there is no substitute for talking to customers. You just have to do it. Doing this well will is helping me become a more strategic business partner.",
        "user": "UJG12DM1V",
        "ts": "1566159738.014400",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "b389ca7fa22c",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-08-20\/2387994825175_b389ca7fa22c18296d7c_72.jpg",
            "first_name": "Janessa",
            "real_name": "Janessa Lantz, VP of Marketing at dbt Labs",
            "display_name": "Janessa",
            "team": "TJE58GTJL",
            "name": "janessalantz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1565964066.013300",
        "parent_user_id": "UJE5LARL0"
    },
    {
        "client_msg_id": "46b1e0e8-2880-43a6-bdbe-b419300d5876",
        "type": "message",
        "text": "That's a long-winded and maybe more theoretical answer than you were looking for :slightly_smiling_face: I think a shorter answer is that there are some places where marketers almost always need developer help:\n1. Data -- if there is anything you can do to help your org get better at collecting or analyzing data that can be crazy impactful for marketing teams and most marketers are not very good at it.\n2. Lead-gen offers -- most marketers can put together a PDF pretty easily, but with a bit of dev help you can do some pretty great stuff. At a previous startup I was at (acquired so I don't think the resource exists anymore) we made a microsite that  generated some pretty basic SQL based on a few inputs. We generated so many leads from that. Here's a great HubSpot example: <https:\/\/www.hubspot.com\/make-my-persona>\n3. Website optimization -- improve site speed and watch ranking go :point_up_2:",
        "user": "UJG12DM1V",
        "ts": "1566160214.014600",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "b389ca7fa22c",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-08-20\/2387994825175_b389ca7fa22c18296d7c_72.jpg",
            "first_name": "Janessa",
            "real_name": "Janessa Lantz, VP of Marketing at dbt Labs",
            "display_name": "Janessa",
            "team": "TJE58GTJL",
            "name": "janessalantz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UJG12DM1V",
            "ts": "1566160219.000000"
        },
        "thread_ts": "1565964066.013300",
        "parent_user_id": "UJE5LARL0"
    }
]