[
    {
        "client_msg_id": "C09EDD46-F502-40C1-A066-A4B8C634A011",
        "type": "message",
        "text": "Microverse is hiring a Head of Marketing, Content &amp; Communications <https:\/\/angel.co\/company\/microverse\/jobs\/663762-head-of-marketing-content-communications>",
        "user": "UJ2N9A3GT",
        "ts": "1575659435.076900",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f423630ff063",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-05-03\/619878402753_f423630ff0633ae9253d_72.png",
            "first_name": "Nick",
            "real_name": "Nick Moore",
            "display_name": "Nick Moore",
            "team": "TJE58GTJL",
            "name": "nickm.yyz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "AngelList",
                "title": "Head of Marketing, Content &amp; Communications at Microverse",
                "title_link": "https:\/\/angel.co\/company\/microverse\/jobs\/663762-head-of-marketing-content-communications",
                "text": "Microverse is hiring a Head of Marketing, Content &amp; Communications in Remote. ############### About... Apply now on AngelList.",
                "fallback": "AngelList: Head of Marketing, Content &amp; Communications at Microverse",
                "thumb_url": "https:\/\/d1qb2nb5cznatu.cloudfront.net\/startups\/i\/4432929-d4c31702d08b4ffaa7be6ae75570ba5b-thumb_jpg.jpg?buster=1541580997",
                "from_url": "https:\/\/angel.co\/company\/microverse\/jobs\/663762-head-of-marketing-content-communications",
                "thumb_width": 100,
                "thumb_height": 100,
                "id": 1,
                "original_url": "https:\/\/angel.co\/company\/microverse\/jobs\/663762-head-of-marketing-content-communications"
            }
        ],
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "UQP1YGQ10",
                    "UJG24P8P6"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "8016637d-568d-4a3f-b116-1025c1e7e570",
        "type": "message",
        "text": "Hey guys, one of my colleagues posted this in our slack channel. Just passing it along here: <https:\/\/seagate.wd1.myworkdayjobs.com\/en-US\/EXT\/job\/Cupertino-United-States\/SEO-and-Content-Marketing-Program-Manage_194522>",
        "user": "UQMMNFRED",
        "ts": "1575665954.077500",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "9d511876ceb1",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-11-22\/847876123766_9d511876ceb10bf8addc_72.png",
            "first_name": "",
            "real_name": "Sheida",
            "display_name": "Sheida",
            "team": "TJE58GTJL",
            "name": "sheidaazimii",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "SEO and Content Marketing Program Manager",
                "title_link": "https:\/\/seagate.wd1.myworkdayjobs.com\/en-US\/EXT\/job\/Cupertino-United-States\/SEO-and-Content-Marketing-Program-Manage_194522",
                "text": "194522 SEO and Content Marketing Program Manager (Open) Title: SEO and Content Marketing Program Manager About our group: The Global Integrated Marketing team is part of the Global Marketing Organization.  Our group leads the overall strategy, development, execution and optimization of integrated campaigns across all Seagate businesses: Enterprise, Client, and Consumer. We identify the marketing mix, lead the development of the campaign components and support programs that increases Seagate brand awareness.  About this role: Looking for a unique, ground floor opportunity where you can showcase your abilities in content strategy and development? As an already established storage industry titan, we’re embarking on an exciting evolution to product strategy and shifting to a more audience centric, content model to support it. Draw from your existing domain expertise and take ownership to help shape a global enterprise content marketing program, broadening your influence and establishing yourself as one of the company's content experts, with a clear path to personal and departmental growth. You will be managing the content supply chain, with a strong focus on acquisition via top-of-the-funnel inbound and outbound marketing programs, with additional emphasis on nurture and education to convert prospects into buyers. As well you will: Create and implement a content marketing strategy, including content creation, curation, and distribution, with the end goal of driving both awareness and customer acquisition. Plan, align and track global content creation and curation efforts to a monthly plan Manage the content supply chain, interlocking, consulting with and enabling content creators in corporate and regional marketing as well our agency and freelance networks.  Maintain a dashboard tracking reach and engagement achievements and in-flight initiatives for executive reporting Interlock with Campaigns, Product Marketing, Web, Analytics, Creative and Demand Generation teams to produce quality content and drive link acquisition to grow Seagate’s SEO footprint. Measure, analyze and report the effectiveness of Content Marketing focusing on SEO, ABM and Lead Generation goals. Help grow our subscriber base by providing them with regular, valuable content aligned with their needs and interests. Regularly track and measure keyword research to guide content strategy Measure, track, and analyze content engagement and performance through use of SEO tools and tactics to evaluate and drive improvement to natural search traffic, entry page quality, content, and template design. About you: Pro-active professional who is highly analytical Expert knowledge of keyword research Hands-on ability with various marketing assets Polished communications and a solid relationship builder Passionate about creating world class B2B content experiences for technical, enterprise audiences Your experience includes: Demonstrated ability in creating unique and engaging B2B content experiences Experience with leading or working in a dedicated content marketing function in a B2B industry Creative, multi-channel approach to B2B content ideation and development Strong SEO knowledge, with proof of previous success in driving keyword research, content strategy and link acquisition Strong understanding of inbound marketing frameworks and processes, marketing campaigns, demand generation, lead capture and nurture Strong organizational skills with ability to effectively prioritize and take leadership initiative Ability to own and maintain the marketing content calendar and library Account Based Marketing experience is a preference but not mandatory Bachelor’s degree and\/or equivalent experience Travel: 0 – 10% Location: Cupertino, CA or Fremont, CA Currently located in Cupertino, CA, this role will move to Fremont, CA in early 2020. Our Gold LEED-certified Fremont product-design campus drives innovation, bringing together a diverse set of engineering, design, operations, support and administrative teams. The site is equipped with state-of-the-art clean room and lab space. On-site social activities are popular, including our annual BBQ, ice cream social, and holiday events. Wellness programs, gaming rooms and the on-site fitness center help round out and balance your Seagate work-life experience, along with opportunities to give back to our local community. Job Family: Professional",
                "fallback": "SEO and Content Marketing Program Manager",
                "from_url": "https:\/\/seagate.wd1.myworkdayjobs.com\/en-US\/EXT\/job\/Cupertino-United-States\/SEO-and-Content-Marketing-Program-Manage_194522",
                "thumb_url": "https:\/\/seagate.wd1.myworkdayjobs.com\/EXT\/assets\/logo",
                "thumb_width": 85,
                "thumb_height": 85,
                "service_icon": "https:\/\/seagate.wd1.myworkdayjobs.com\/favicon.ico",
                "service_name": "seagate.wd1.myworkdayjobs.com",
                "id": 1,
                "original_url": "https:\/\/seagate.wd1.myworkdayjobs.com\/en-US\/EXT\/job\/Cupertino-United-States\/SEO-and-Content-Marketing-Program-Manage_194522"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "xLG",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Hey guys, one of my colleagues posted this in our slack channel. Just passing it along here: "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/seagate.wd1.myworkdayjobs.com\/en-US\/EXT\/job\/Cupertino-United-States\/SEO-and-Content-Marketing-Program-Manage_194522"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "client_msg_id": "B887A7B5-77BF-457B-BB82-C77397A0930C",
        "type": "message",
        "text": "Holloway is looking for freelance writers to work on their remote work guide <https:\/\/twitter.com\/courtneynash\/status\/1202645585309814785>",
        "user": "UJ2N9A3GT",
        "ts": "1575687578.078300",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f423630ff063",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-05-03\/619878402753_f423630ff0633ae9253d_72.png",
            "first_name": "Nick",
            "real_name": "Nick Moore",
            "display_name": "Nick Moore",
            "team": "TJE58GTJL",
            "name": "nickm.yyz",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]