[
    {
        "client_msg_id": "c3866ccc-e090-4e52-92db-d65c528d3354",
        "type": "message",
        "text": "For the international content marketers, we're hiring for a couple of roles at Shopify:\n- Content Marketer (French) <https:\/\/jobs.lever.co\/shopify\/48823213-3e93-4d40-a8cf-b876c1e4f9f6?lever-via=UsUEn3uBor>\n- Content Marketer (German) <https:\/\/jobs.lever.co\/shopify\/5c514367-fd86-49aa-be68-2596e0677ea0?lever-via=UsUEn3uBor>",
        "user": "UJHK5E5FG",
        "ts": "1572355661.018200",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "g6279fcf6c09",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/796279fcf6c094fdac8157c7a2ca05cb.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0008-72.png",
            "first_name": "Adam",
            "real_name": "Adam Rogers",
            "display_name": "Adam Rogers",
            "team": "TJE58GTJL",
            "name": "adamrogers.uk",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "Shopify - French Content Marketer",
                "title_link": "https:\/\/jobs.lever.co\/shopify\/48823213-3e93-4d40-a8cf-b876c1e4f9f6?lever-via=UsUEn3uBor",
                "text": "We’re looking for a highly motivated French speaking content marketer who is passionate about entrepreneurship, e-commerce, and digital marketing. Your task will be to localize and create compelling content that helps our French speaking merchants build, launch, and grow successful businesses with Oberlo and Shopify. You’ll be localizing marketing materials, writing new original blog posts, as well as working on other content projects (what these are is largely up to you) to help drive traffic and leads from French speaking countries. Long-term dedication is preferred. We are looking for someone who will grow with us for many years. Your role and tasks will expand and change as the company evolves and grows. This is an entrepreneurial environment and things move quickly! You up for it?",
                "fallback": "Shopify - French Content Marketer",
                "thumb_url": "https:\/\/lever-client-logos.s3.amazonaws.com\/ba2cf5cc-6afc-4709-bc82-fcdd35ffc8d2-1490971643074.png",
                "fields": [
                    {
                        "title": "Location",
                        "value": "Berlin, Germany",
                        "short": true
                    },
                    {
                        "title": "Team",
                        "value": "Marketing &amp; Communications",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/jobs.lever.co\/shopify\/48823213-3e93-4d40-a8cf-b876c1e4f9f6?lever-via=UsUEn3uBor",
                "thumb_width": 400,
                "thumb_height": 400,
                "service_icon": "https:\/\/jobs.lever.co\/favicon.ico",
                "service_name": "jobs.lever.co",
                "id": 1,
                "original_url": "https:\/\/jobs.lever.co\/shopify\/48823213-3e93-4d40-a8cf-b876c1e4f9f6?lever-via=UsUEn3uBor"
            },
            {
                "title": "Shopify - German Content Marketer",
                "title_link": "https:\/\/jobs.lever.co\/shopify\/5c514367-fd86-49aa-be68-2596e0677ea0?lever-via=UsUEn3uBor",
                "text": "We’re looking for a highly motivated German speaking content marketer who is passionate about entrepreneurship, ecommerce, and digital marketing. Your task will be to localize and create compelling content that helps our German speaking merchants build, launch, and grow successful businesses with Oberlo and Shopify. You’ll be localizing marketing materials, writing new original blog posts, as well as working on other content projects – what these are is largely up to you – to help drive traffic and leads from German speaking countries. Long-term dedication is preferred. We are looking for someone who will grow with us for many years. Your role and tasks will expand and change as the company evolves and grows. This is an entrepreneurial environment and things move quickly! You up for it?",
                "fallback": "Shopify - German Content Marketer",
                "thumb_url": "https:\/\/lever-client-logos.s3.amazonaws.com\/ba2cf5cc-6afc-4709-bc82-fcdd35ffc8d2-1490971643074.png",
                "fields": [
                    {
                        "title": "Location",
                        "value": "Berlin, Germany",
                        "short": true
                    },
                    {
                        "title": "Team",
                        "value": "Marketing &amp; Communications",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/jobs.lever.co\/shopify\/5c514367-fd86-49aa-be68-2596e0677ea0?lever-via=UsUEn3uBor",
                "thumb_width": 400,
                "thumb_height": 400,
                "service_icon": "https:\/\/jobs.lever.co\/favicon.ico",
                "service_name": "jobs.lever.co",
                "id": 2,
                "original_url": "https:\/\/jobs.lever.co\/shopify\/5c514367-fd86-49aa-be68-2596e0677ea0?lever-via=UsUEn3uBor"
            }
        ]
    },
    {
        "client_msg_id": "492690EF-5BF1-4A53-BC46-DB88D30AD44A",
        "type": "message",
        "text": "Salesforce is hiring an editorial lead <https:\/\/salesforce.wd1.myworkdayjobs.com\/en-US\/External_Career_Site\/job\/California---San-Francisco\/Editorial-Lead_JR51948>",
        "user": "UJ2N9A3GT",
        "ts": "1572355698.018700",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f423630ff063",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-05-03\/619878402753_f423630ff0633ae9253d_72.png",
            "first_name": "Nick",
            "real_name": "Nick Moore",
            "display_name": "Nick Moore",
            "team": "TJE58GTJL",
            "name": "nickm.yyz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "Editorial Lead",
                "title_link": "https:\/\/salesforce.wd1.myworkdayjobs.com\/en-US\/External_Career_Site\/job\/California---San-Francisco\/Editorial-Lead_JR51948",
                "text": "Job CategoryMarketing Job Details We are looking for a creative, collaborative, and well-rounded senior writer\/content marketer to support content for the sales audience. This individual will be central to content execution for the sales persona. The Editorial Lead will manage content creation and editorial planning as part of Salesforce’s content strategy team. In this invaluable role, you’ll bring a high bar for editorial quality, the ability to simplify complex topics through writing and editing, and proven expertise in putting a content plan into action – across production, optimization, and amplification. If you’re the right candidate, then storytelling, clear communication, and organizational skills are in your DNA. Your colleagues would describe you as resourceful, comfortable with ambiguity, and open to acting on constructive feedback. You probably have your company’s style guide memorized – and you have a sixth sense for when a piece of content isn’t striking the right tone. This strategic role works cross-functionally to align key collaborators on cross-channel content that resonates with sales leaders and practitioners. This team member won’t plan, write, and edit in a silo. Instead, they’ll forge relationships with internal and external stakeholders to create strategic content that suits the sales audience’s needs. The Editorial Lead will also track content growth along the way and craft strong executive-facing slide decks to support and explain that growth.   Responsibilities Write, edit, and curate original content for sales prospects and customers Leverage content of all kinds – including influencer interviews, media bylines, blog posts, brand journalism, multimedia series, learning modules on Trailhead, and SEO articles – to meet content marketing goals and objectives Plan and maintain an editorial calendar that supports marketing and product marketing strategy Uphold Salesforce voice and tone in every piece of content Pitch new story ideas and content formats Design, appoint, and oversee sales editorial review board Collaborate with product marketing, creative, campaigns, social media, customer marketing, and program management as key stakeholders Together with key stakeholders, prioritize topics within the editorial calendar, ensure consistent quality, and optimize delivery across channels Maintain clear, organized communication to stakeholders, even as team goals and priorities shift Interview Salesforce customer Trailblazers and incorporate their voices into content to tell their unique, inspiring stories Measure success and test new ways of doing things Contribute to other content team initiatives – including events, strategic communications, and executive presentations – when needed Required Skills &amp; Experience 5+ years of experience in content marketing, journalism, or professional writing\/editing at a tech company (or within a similar fast-paced industry) Tech industry knowledge and interest, particularly within CRM and enterprise sales applications. You’re plugged into what’s trending at the intersection of business and technology. Past experience as a lead writer or editor following a style guide. Only the best content passes your sniff test, and you take pride in your first draft. Creative thinker who can not only identify gaps or opportunities, but also offers ways to address them. When you encounter obstacles, you find an effective solution with a positive mindset. Excessively organized. Your calendar is your best friend, and while leading meetings with stakeholders, you make sure their time is well spent. Proven ability to work well externally: with customers, with channel partners, and with agencies. Beyond external content, you bring internal communication excellence – using PowerPoint, Google Slides, and other meeting tools to get the whole team onboard. You use on-slide visuals and a sparkling talk track to share data, ideas, and insights quickly. Social media and influencer marketing skills a plus. Experience working with Kapost, Quip, AEM, and Wordpress a plus. Posting Statement <http:\/\/Salesforce.com|Salesforce.com> and <http:\/\/Salesforce.org|Salesforce.org> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes\/CVs through this Web site or directly to managers. <http:\/\/Salesforce.com|Salesforce.com> and <http:\/\/Salesforce.org|Salesforce.org> do not accept unsolicited headhunter and agency resumes. <http:\/\/Salesforce.com|Salesforce.com> and <http:\/\/Salesforce.org|Salesforce.org> will not pay fees to any third-party agency or company that does not have a signed agreement with <http:\/\/Salesforce.com|Salesforce.com> or Salesforce.org.Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
                "fallback": "Editorial Lead",
                "from_url": "https:\/\/salesforce.wd1.myworkdayjobs.com\/en-US\/External_Career_Site\/job\/California---San-Francisco\/Editorial-Lead_JR51948",
                "thumb_url": "https:\/\/salesforce.wd1.myworkdayjobs.com\/External_Career_Site\/assets\/logo",
                "thumb_width": 85,
                "thumb_height": 85,
                "service_icon": "https:\/\/salesforce.wd1.myworkdayjobs.com\/favicon.ico",
                "service_name": "salesforce.wd1.myworkdayjobs.com",
                "id": 1,
                "original_url": "https:\/\/salesforce.wd1.myworkdayjobs.com\/en-US\/External_Career_Site\/job\/California---San-Francisco\/Editorial-Lead_JR51948"
            }
        ],
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UJG9WTEKG",
                    "UJG24P8P6",
                    "UJ48Q1HAP",
                    "UJJELJPNH",
                    "UJ7RT1J1X"
                ],
                "count": 5
            }
        ]
    },
    {
        "client_msg_id": "311c21ae-35b8-432c-9e48-d3ddd9ece25e",
        "type": "message",
        "text": "THATS a job :point_up:",
        "user": "UJE5LQ2JC",
        "ts": "1572358092.019200",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f0b1eb794d0a",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-11-05\/810787383395_f0b1eb794d0acc18306a_72.jpg",
            "first_name": "Sean",
            "real_name": "Sean Blanda",
            "display_name": "",
            "team": "TJE58GTJL",
            "name": "scblanda",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "reactions": [
            {
                "name": "100",
                "users": [
                    "UKSSGHC8P"
                ],
                "count": 1
            }
        ]
    }
]