[
    {
        "type": "message",
        "subtype": "thread_broadcast",
        "text": "Looks like a really interesting role. I know some of the Dublin folks and it would be a great team to work with",
        "user": "UQ079M31P",
        "ts": "1608303391.027000",
        "thread_ts": "1608236096.025200",
        "root": {
            "client_msg_id": "73706b9f-5651-469d-8d06-a3697135f24d",
            "type": "message",
            "text": "Clio is hiring for a content marketing manager for our Dublin team. We're transitioning to distributed by design, but still you would need to be somewhere in Ireland and legally able to work in Ireland for this role <https:\/\/boards.greenhouse.io\/goclio\/jobs\/2544758> DM me if you have questions!",
            "user": "UUVC10WAY",
            "ts": "1608236096.025200",
            "team": "TJE58GTJL",
            "attachments": [
                {
                    "title": "Content Marketing Manager, EMEA",
                    "title_link": "https:\/\/boards.greenhouse.io\/goclio\/jobs\/2544758",
                    "text": "Dublin",
                    "fallback": "Content Marketing Manager, EMEA",
                    "image_url": "https:\/\/recruiting.cdn.greenhouse.io\/external_greenhouse_job_boards\/logos\/000\/006\/966\/original\/Job-Posting-Template_V4-04.png?1564093911",
                    "from_url": "https:\/\/boards.greenhouse.io\/goclio\/jobs\/2544758",
                    "image_width": 478,
                    "image_height": 250,
                    "image_bytes": 114722,
                    "service_icon": "https:\/\/boards.greenhouse.io\/favicon.ico",
                    "service_name": "boards.greenhouse.io",
                    "id": 1,
                    "original_url": "https:\/\/boards.greenhouse.io\/goclio\/jobs\/2544758"
                }
            ],
            "blocks": [
                {
                    "type": "rich_text",
                    "block_id": "+bN",
                    "elements": [
                        {
                            "type": "rich_text_section",
                            "elements": [
                                {
                                    "type": "text",
                                    "text": "Clio is hiring for a content marketing manager for our Dublin team. We're transitioning to distributed by design, but still you would need to be somewhere in Ireland and legally able to work in Ireland for this role "
                                },
                                {
                                    "type": "link",
                                    "url": "https:\/\/boards.greenhouse.io\/goclio\/jobs\/2544758"
                                },
                                {
                                    "type": "text",
                                    "text": " DM me if you have questions!"
                                }
                            ]
                        }
                    ]
                }
            ],
            "thread_ts": "1608236096.025200",
            "reply_count": 1,
            "reply_users_count": 1,
            "latest_reply": "1608303391.027000",
            "reply_users": [
                "UQ079M31P"
            ],
            "replies": [
                {
                    "user": "UQ079M31P",
                    "ts": "1608303391.027000"
                }
            ],
            "is_locked": false,
            "subscribed": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "cuCH",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Looks like a really interesting role. I know some of the Dublin folks and it would be a great team to work with"
                            }
                        ]
                    }
                ]
            }
        ],
        "client_msg_id": "73ee5fc6-c033-487b-811d-297065f4ddad",
        "reactions": [
            {
                "name": "100",
                "users": [
                    "UUVC10WAY"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "7a478373-0953-4391-aa8f-f21cfce78880",
        "type": "message",
        "text": "Workiva is hiring a <https:\/\/workiva.wd1.myworkdayjobs.com\/en-US\/careers\/job\/Amsterdam\/Global-Content-Marketing-Specialist_R1167#path=%3F_lrsc%3D0ae1436b-797a-4fca-9f4e-8fe9a28d9ffd|Global Content Marketing Specialist> in our Amsterdam or London office. Incredible growth happening with the company, both in the US and EMEA, and this role would basically own non-US content strategy. I work closely with this role, so I'm happy to answer any questions.",
        "user": "U01GGQMG6HW",
        "ts": "1608310077.029200",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "452a7d7f7d7b",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-30\/1537252225731_452a7d7f7d7b0e461def_72.jpg",
            "first_name": "Drew",
            "real_name": "Drew Deubner",
            "display_name": "Drew Deubner",
            "team": "TJE58GTJL",
            "name": "ddeubner",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "Global Content Marketing Specialist",
                "title_link": "https:\/\/workiva.wd1.myworkdayjobs.com\/en-US\/careers\/job\/Amsterdam\/Global-Content-Marketing-Specialist_R1167#path=%3F_lrsc%3D0ae1436b-797a-4fca-9f4e-8fe9a28d9ffd",
                "text": "The role The Global Content Marketing Specialist creates a full range of product and solution-focused marketing materials. This role brings depth of channel, industry and marketplace knowledge to the table, along with a metrics-driven approach to content development and curation. The Specialist develops content strategy and manages editorial calendars for product and solution- focused marketing materials localized according to audience. What You'll Do Ensures brand and marketing consistency and flawless execution across all tactics Puts the end user first, adjusting output based on audience need and interest Provides a high level of industry and solution knowledge to create marketing and thought leadership content, including: product datasheets, brochures, industry white papers, infographics, e-books, emails, product demonstration videos, web content, multimedia presentations, and more Makes suggestions to improve content performance based on depth of knowledge across key channels; responsible for goal-setting and optimization efforts based on click-through rates, traffic, and conversions Ensures consistency in brand and tone standards throughout Workiva communications, while also respecting localization and language considerations Makes strategic recommendations across solutions based on depth of knowledge in key market areas, regional and cultural considerations, subject matter areas, feedback loops, and success metrics Implements local\/regional SEO best practices throughout content creation process Manages multiple initiatives simultaneously and ensures the successful completion of each under tight deadlines Supports the overarching integration of the marketing activities throughout the company by ensuring that all affected departments and\/or offices are kept in the communication loop on project status Ensures all elements of all contracted agreements have been satisfactorily executed as contracted Coordinates and collaborates with vendors and ensures quality of third-party content, which may include helping manage agency relationships and securing translation services as needed Develops ROI and performance measurements for marketing tactics Provides organization and reporting What You'll Need Skills Excellent writing, editing and business communication skills Self-starter who takes initiative and brings new ideas for consideration Flourishes in a fast-paced environment Accurate, meticulous, with high attention to detail Excellent work ethic and time management skills Ability to effectively present information and respond to questions Ability to take initiative and be resourceful as issues arise Ability to solve practical problems and deal with a variety of variables within a situation Exceptional organizational, interpersonal, and project management skills Ability to adapt quickly to changing situations Ability to interact with internal peers and management as well as vendors and outside agencies Experience Five to seven years industry experience, preferably on a creative or marketing team Experience with content marketing and creating digital assets Experience with writing for B2B audiences, SaaS or technical products, and complex audience segmentation Experience with developing B2B marketing content for international distribution is required Experience working with a geographically distributed team and managing multinational vendor relationships is required Multiple examples of developing clear, successful communications on complex topics (portfolio required) Education University degree in marketing, advertising, communications and seven or more years industry experience in related field is preferred M.B.A. preferred Working Conditions &amp; Physical Requirements Reliable internet access for any period of time working remotely, not in a Workiva office. Where You’ll Work Our values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created. Customer Success:  Always delight our customers. Trust: Rely on each other.  Integrity: Do the right thing, every time.  Collaboration: Share resources and work together.  Innovation: Keep creating solutions and finding better ways.  Inclusion: Support a diverse community where we all belong.  Accountability: Be responsible for your success and failure. We believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems. At Workiva, you’ll enjoy:  Casual Dress: Workiva has a casual work environment, most people wear jeans to the office. Involvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more Work-life Balance: We have competitive PTO, VTO and Parental Leave. We encourage employees to spend time enjoying life outside of work.   Learn more: <https:\/\/www.linkedin.com\/company\/workiva\/life\/> Workiva is an Equal Opportunity Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation.  Employment decisions are made without regard to age, gender identity, race, religion, disability status, sexual orientation, or any other protected characteristic.   Workiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com.",
                "fallback": "Global Content Marketing Specialist",
                "image_url": "https:\/\/workiva.wd1.myworkdayjobs.com\/careers\/assets\/logo",
                "from_url": "https:\/\/workiva.wd1.myworkdayjobs.com\/en-US\/careers\/job\/Amsterdam\/Global-Content-Marketing-Specialist_R1167#path=%3F_lrsc%3D0ae1436b-797a-4fca-9f4e-8fe9a28d9ffd",
                "image_width": 478,
                "image_height": 250,
                "image_bytes": 16077,
                "service_icon": "https:\/\/workiva.wd1.myworkdayjobs.com\/favicon.ico",
                "service_name": "workiva.wd1.myworkdayjobs.com",
                "id": 1,
                "original_url": "https:\/\/workiva.wd1.myworkdayjobs.com\/en-US\/careers\/job\/Amsterdam\/Global-Content-Marketing-Specialist_R1167#path=%3F_lrsc%3D0ae1436b-797a-4fca-9f4e-8fe9a28d9ffd"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Jas\/y",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Workiva is hiring a "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/workiva.wd1.myworkdayjobs.com\/en-US\/careers\/job\/Amsterdam\/Global-Content-Marketing-Specialist_R1167#path=%3F_lrsc%3D0ae1436b-797a-4fca-9f4e-8fe9a28d9ffd",
                                "text": "Global Content Marketing Specialist"
                            },
                            {
                                "type": "text",
                                "text": " in our Amsterdam or London office. Incredible growth happening with the company, both in the US and EMEA, and this role would basically own non-US content strategy. I work closely with this role, so I'm happy to answer any questions."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "client_msg_id": "02706c42-1229-441c-8cba-ecec7b77bca2",
        "type": "message",
        "text": "A friend of mine who works at SERHANT. (a new real estate brokerage founded by the Bravo TV star Ryan Serhant) is looking to hire a content marketing manager. If interested shoot me your resume and I'll pass it along. Here is the job description: <https:\/\/www.linkedin.com\/jobs\/view\/2329265920\/?refId=1759237081608320873657&amp;trackingId=rGeKyEuIIou9xeo8A6k7nA%3D%3D>",
        "user": "UUE7J6UDN",
        "ts": "1608321378.030600",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f1a97da24d4c",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-08-13\/2403885855088_f1a97da24d4c59536828_72.jpg",
            "first_name": "Matthew",
            "real_name": "Matthew Speiser",
            "display_name": "Matthew Speiser",
            "team": "TJE58GTJL",
            "name": "spyzguyz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "ExOfk",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "A friend of mine who works at SERHANT. (a new real estate brokerage founded by the Bravo TV star Ryan Serhant) is looking to hire a content marketing manager. If interested shoot me your resume and I'll pass it along. Here is the job description: "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.linkedin.com\/jobs\/view\/2329265920\/?refId=1759237081608320873657&trackingId=rGeKyEuIIou9xeo8A6k7nA%3D%3D"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]