[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*Fortunian is hiring a Content Manager* :rocket:\n\n*This is a full-time role.*\n\n*What's the deal?* \n\nFortunian is a performance marketing agency headquartered in Atlanta, GA, employing razor-sharp talent across the globe. We are the secret weapon franchises, educational institutions and other high-growth organizations use to achieve the impossible. We’re so confident in our abilities that nearly all of our clients pay us _on performance_. This means we’re results-oriented and we need you to be too. \nOur team members are focused on getting the right things done, on time, every time. As a result, we are able to have a fun, typically low-pressure work environment. \nHere’s where you come in. \nWe’re seeking a Content Manager to join us full-time, remote, to take the marketing strategy provided by our marketing leads (potentially with your input), and manage the content production and implementation. \nDon’t worry: We have skilled writers, project managers, account executives, and technicians who will post the content. \nBut we need someone with _wide arms_ to hold onto the content strategy and ensure the right content is being produced. \nFor example, we’re building out a multi-path funnel for potential applicants at a top-tier creative school. Depending on the academic path they want to go down, we need to provide relevant content to support their decision making process and encourage them to submit their application. Your role with this project would be to fully understand the customer journey, then detail the content that needs to be produced, then manage the content team in getting the content created and delivered. \nExtra “would be stoked if you had” skills:\n- Experience in SEO content production (if not, we can teach you)\n- Experience managing writers (or a room full of people)\n- The confidence to have a call one-on-one with a client, to ask them pressing questions so you can formulate the ideal content plan\nWe’re hiring a FULL TIME CONTENT MANAGER and the position is REMOTE. That said, the entire company works on US East Coast hours. We do daily stand-ups at 9:00am Eastern and need you to attend those without fail. \nIf you think you’re a great fit for our company, we’d love to have you. We’re interested in giving folks with tangential experience a shot, so if you’re an English Teacher and you’re looking for your next gig out of the classroom, please apply. We want folks who are coachable, open to growth, ready to be team players, and have a not-so-secret obsession with the Oxford comma.\n\nTo apply:\n1. Read this Impact Filter with the success criteria of the role: <https:\/\/docs.google.com\/document\/d\/1yusJ35uWVLljqXAb\\_oHuFgMhm3uDXKfVvOVWM33S9q8\/edit>\n2. If you’re a good fit, email [casey@fortunian.com](<mailto:casey@fortunian.com>) with the subject line “Casey - I would CRUSH this Content Manager Role!” with your work history and the answers to these questions: \n3. What about this job post is making you want to apply? Be honest! \n    1. \n    2. If we met in 2 years from today and you were THRILLED about your life, both personally and professionally, what would you be doing? Where would you be living? Tell us this in 3-5 sentences with enough detail for us to taste your excitement. It would be a dream come true if we could help make your dream come true. \n\n\n\n*To apply, send an email to:* `<mailto:casey@fortunian.com|casey@fortunian.com>`",
        "ts": "1613168497.151700",
        "username": "Superpath Job Bot",
        "icons": {
            "emoji": ":space_invader:",
            "image_64": "https:\/\/a.slack-edge.com\/production-standard-emoji-assets\/13.0\/apple-large\/1f47e.png"
        },
        "bot_id": "B0199MPQELR",
        "thread_ts": "1613168497.151700",
        "reply_count": 1,
        "reply_users_count": 1,
        "latest_reply": "1613408692.154000",
        "reply_users": [
            "U01MV98FQAY"
        ],
        "replies": [
            {
                "user": "U01MV98FQAY",
                "ts": "1613408692.154000"
            }
        ],
        "is_locked": false,
        "subscribed": false,
        "reactions": [
            {
                "name": "wave",
                "users": [
                    "U01MV98FQAY",
                    "U01J84U3SQ6",
                    "U01K26PH1L3"
                ],
                "count": 3
            },
            {
                "name": "fire",
                "users": [
                    "UJG9WTEKG"
                ],
                "count": 1
            }
        ]
    }
]