[
    {
        "client_msg_id": "268cf5b6-3da9-4f9c-9e54-4e40902f6ea4",
        "type": "message",
        "text": "<https:\/\/www.youtube.com\/watch?v=6x_cnD4Tc2w>",
        "user": "UJG9WTEKG",
        "ts": "1598280476.007700",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "gc25b94e6ebf",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/eec25b94e6ebf55f0b7933372344cd09.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0001-72.png",
            "first_name": "Jimmy",
            "real_name": "Jimmy Daly",
            "display_name": "",
            "team": "TJE58GTJL",
            "name": "runjimdaly",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/",
                "title": "EMAIL MARKETING FOR BEGINNERS - From 0 to 100 subscribers",
                "title_link": "https:\/\/www.youtube.com\/watch?v=6x_cnD4Tc2w",
                "author_name": "Noah Kagan",
                "author_link": "https:\/\/www.youtube.com\/user\/crxnamja",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/6x_cnD4Tc2w\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: EMAIL MARKETING FOR BEGINNERS - From 0 to 100 subscribers",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/6x_cnD4Tc2w?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/www.youtube.com\/watch?v=6x_cnD4Tc2w",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/youtube.png",
                "id": 1,
                "original_url": "https:\/\/www.youtube.com\/watch?v=6x_cnD4Tc2w"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "2ts6\/",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "link",
                                "url": "https:\/\/www.youtube.com\/watch?v=6x_cnD4Tc2w"
                            }
                        ]
                    }
                ]
            }
        ],
        "thread_ts": "1598108697.007400",
        "parent_user_id": "U016G65CCUS"
    },
    {
        "client_msg_id": "f1635352-2ad1-421b-b618-4992dd9755f5",
        "type": "message",
        "text": "not suggesting that you are a beginner but noah’s stuff on this is good",
        "user": "UJG9WTEKG",
        "ts": "1598280488.008000",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "gc25b94e6ebf",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/eec25b94e6ebf55f0b7933372344cd09.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0001-72.png",
            "first_name": "Jimmy",
            "real_name": "Jimmy Daly",
            "display_name": "",
            "team": "TJE58GTJL",
            "name": "runjimdaly",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "2Cu",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "not suggesting that you are a beginner but noah’s stuff on this is good"
                            }
                        ]
                    }
                ]
            }
        ],
        "thread_ts": "1598108697.007400",
        "parent_user_id": "U016G65CCUS",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U016G65CCUS"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "696c97e5-372e-4102-818e-55be5d4806a4",
        "type": "message",
        "text": "Thanks <@UJG9WTEKG>, appreciate it.",
        "user": "U016G65CCUS",
        "ts": "1598286081.008200",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "9a98775a8c73",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-07-13\/1238380640803_9a98775a8c73787f8b6c_72.jpg",
            "first_name": "Mehdi",
            "real_name": "Mehdi Hussen",
            "display_name": "Mehdi Hussen",
            "team": "TJE58GTJL",
            "name": "mehdi",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "8uXX",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Thanks "
                            },
                            {
                                "type": "user",
                                "user_id": "UJG9WTEKG"
                            },
                            {
                                "type": "text",
                                "text": ", appreciate it."
                            }
                        ]
                    }
                ]
            }
        ],
        "thread_ts": "1598108697.007400",
        "parent_user_id": "U016G65CCUS"
    },
    {
        "client_msg_id": "5BBDBA45-19A1-4B3A-8CF7-36E79EFF3132",
        "type": "message",
        "text": "Really interesting article, especially if you’re trying to write for Twitter thought leader types <https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/|https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/>",
        "user": "UJ2N9A3GT",
        "ts": "1598317482.010200",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "f423630ff063",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-05-03\/619878402753_f423630ff0633ae9253d_72.png",
            "first_name": "Nick",
            "real_name": "Nick Moore",
            "display_name": "Nick Moore",
            "team": "TJE58GTJL",
            "name": "nickm.yyz",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "alexdanco.com",
                "service_url": "http:\/\/alexdanco.com",
                "title": "Homesteading the Twittersphere",
                "title_link": "https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/",
                "author_name": "Alex Danco",
                "author_link": "https:\/\/alexdanco.com\/author\/adanco\/",
                "text": "If you go to&nbsp;the About page&nbsp;on Matthew Ball&rsquo;s website,&nbsp;you&rsquo;ll find a quote from Jason Hirschhorn:\n\n\n\n&ldquo;Kevin Mayer called and said &lsquo;Hey, Bob Iger and I would like to have lunch with you&rsquo;&hellip;And Iger, I&rsquo;m going to paraphrase here, says &lsquo;You know, you&rsquo;re an idiot.&rsquo; And I&rsquo;m like, &lsquo;Why is that, Bob?&rsquo; And he goes, &ldquo;You give away for free what we pay tens of millions of dollars a year from management consultants for.&rdquo;&nbsp;\n\n\n\nKevin was talking about Matt&rsquo;s Disney-as-a-Service post from 2016; but it could have been any of his publicly posted essays, as they&rsquo;re all a) just superb analysis, and b) available for free, to anyone. If you want to learn about the media business today, you&rsquo;ll find an abundance of potential learning material &ndash; and a lot of it, as you&rsquo;d expect, is paid or monetized in some way. But the very best&nbsp;analysis is free.&nbsp;\n\n\n\nWe&rsquo;re pretty lucky. Every day we open up Twitter and can plausibly expect for some gem to show up, like&nbsp;Kevin Kwok on Figma, or Turner Novak on Pinduoduo, and expect to read them for free. In certain slices of the new knowledge economy, particularly in financial analysis or in business strategy, you can get a mediocre product for a price, but the very best products are free.&nbsp;Someone wrote it down and shared it; not for money, but for something else.&nbsp;\n\n\n\nYou have to know who&rsquo;s writing them, but it&rsquo;s usually not that hard to find if you spend time on Twitter or other online communities. More often than not, these aren&rsquo;t one-off posts. You get to know the recurring characters who foster interesting niches for themselves: off the top of my head, people like&nbsp;Ryan Dawidjan on audio, Vicki Boykis on machine learning,&nbsp;or Ben Basche on ephemerality. Other people have earned an automatic association with helping us understand a particular industry, like @Post_Market on food and delivery, or become immediately associated with a specific business, like Julie Young on Sea Limited&nbsp;or Kevin Lee on Swedish oat milk.&nbsp;&nbsp;&nbsp;\n\n\n\nIn many of these cases, the authors have ulterior motives. I certainly do with my own newsletter; it&rsquo;s gotten me every real job I&rsquo;ve ever had since grad school. Same for anyone who&rsquo;s investing and wants dealflow, or hustling on an early product. But something else is clearly going on too. There is an economy at work here, but it&rsquo;s not an exchange economy.\n\n\n\nIt recently occurred to me that the really obvious comparison for what&rsquo;s going on here is the open source software community back in the 90s. Eric S Raymond&rsquo;s essay Homesteading the Noosphere, a reference text on the social norms and incentive structure of the free software movement, explains exactly what&rsquo;s going on. We&rsquo;re no longer dealing with a world of scarcity, where exchange economies are the default way we assign and trade value. This is an environment of abundance. There&rsquo;s no material scarcity or friction at work here, but there&rsquo;s still a lot of work to do. And so a new value model emerges: gift culture. And with it, a really good metaphor for how we develop and share knowledge on Twitter: &ldquo;Homesteading.&rdquo;&nbsp;\n\n\n\nI&rsquo;m just going to quote at length from Raymond here:\n\n\n\nHuman beings have an innate drive to compete for social status; it&rsquo;s wired in by our evolutionary history. For the 90% of hominid history that ran before the invention of agriculture, our ancestors lived in small nomadic hunter-gatherer bands. High-status individuals (those most effective at informing coalitions and persuading others to cooperate with them) got the healthiest mates and access to the best food. This drive for status expresses itself in different ways, depending largely on the degree of scarcity of survival goods.\n\n\n\nMost ways humans have of organizing are adaptations to scarcity and want. Each way carries with it different ways of gaining social status.\n\n\n\nThe simplest way is the command hierarchy. In command hierarchies, scarce goods are allocated by one central authority and backed up by force. Command hierarchies scale very poorly; they become increasingly brutal and inefficient as they get larger. For this reason, command hierarchies above the size of an extended family are almost always parasites on a larger economy of a different type. In command hierarchies, social status is primarily determined by access to coercive power.\n\n\n\nOur society is predominantly an exchange economy. This is a sophisticated adaptation to scarcity that, unlike the command model, scales quite well. Allocation of scarce goods is done in a decentralized way through trade and voluntary cooperation (and in fact, the dominating effect of competitive desire is to produce cooperative behavior). In an exchange economy, social status is primarily determined by having control of things (not necessarily material things) to use or trade.\n\n\n\nMost people have implicit mental models for both of the above, and how they interact with each other. &hellip; There&rsquo;s a third model, however, that is radically different from either and not generally recognized except by anthropologists; the gift culture.\n\n\n\nGift cultures are adaptations not to scarcity but to abundance.They arise in populations that do not have significant material-scarcity problems with survival goods. We can observe gift cultures in action among aboriginal cultures living in ecozones with mild climates and abundant food. We can also observe them in certain strata of our own society, especially in show business and among the very wealthy.\n\n\n\nAbundance makes command relationships difficult to sustain and exchange relationships an almost pointless game. In gift cultures, social status is determined not by what you control but by what you give away.\n\n\n\n&hellip;Thus the multi-millionaire&rsquo;s elaborate and usually public acts of philanthropy. And thus the hacker&rsquo;s long hours of effort to produce high-quality open-source code.\n\n\n\nFor examined in this way, it is quite clear that the society of open-source hackers is in fact a gift culture. Within it, there is no serious shortage of the `survival necessities&rsquo;&mdash;disk space, network bandwidth, computing power. Software is freely shared. This abundance creates a situation in which the only available measure of competitive success is reputation among one&rsquo;s peers.\n\n\n\nAbundant environments may surprise you: even though they&rsquo;re lacking in material scarcity or literal friction, there&rsquo;s still plenty of work to do. It&rsquo;s just a different kind of work: the work of dealing with complexity, clarity, curation, and especially&nbsp;synthesis. The effort and value being traded here lend themselves far more naturally to a gift culture economy, which is still very&nbsp;much an economy. It&rsquo;s just not a transactional one.\n\n\n\nThe other obvious kind of work to do in an abundant environment, of course, is achieve and maintain positional scarcity. Status is clearly scarce, and in a gift culture like the free software community &ndash; or on Finance Twitter &ndash; the way you earn status is by putting in real effort, and then giving away the fruits of that effort.&nbsp;\n\n\n\nOf course, the effort you put in has to actually be valuable, and recognized as such by your peer group. So the optimal thing for you to do, whether you&rsquo;re an open source software developer or a Twitter armchair analyst, is to figure out your specialty zone that&rsquo;s simultaneously useful, but unique &ndash; and then homestead&nbsp;it. Establish and cultivate it, like a garden or a plot of land, that you&rsquo;re tending for the communal benefit of everyone. People come to associate that little plot of land with you specifically, and think of you whenever they go near it.&nbsp;\n\n\n\nIf you&rsquo;ve followed me fo…",
                "fallback": "alexdanco.com Link: Homesteading the Twittersphere",
                "from_url": "https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/",
                "service_icon": "https:\/\/alexdanco.files.wordpress.com\/2019\/10\/ttaat-square.png?w=180",
                "id": 1,
                "original_url": "https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "j\/O",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Really interesting article, especially if you’re trying to write for Twitter thought leader types "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/",
                                "text": "https:\/\/alexdanco.com\/2020\/08\/21\/homesteading-the-twittersphere\/"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]