[
    {
        "client_msg_id": "23b96769-6ad6-4178-9e4f-72260e80ee00",
        "type": "message",
        "text": "Hi all! I have a recommendation for transcription work. I send out a ton of recordings for transcription as I write case studies and blog content from interviews. Normally, I use <http:\/\/Rev.com|Rev.com> which is an awesome service. However, I have a good friend who does transcription at about the same rate as Rev, and she's a joy! I'll be using her moving forward and highly recommend her to anyone needing transcripts. She's not exactly a \"tool\" but I wasn't sure where else to put this. Her name is Maggie Weber. maggiew at gmail.",
        "user": "UJ57DB9BM",
        "ts": "1586021229.014100",
        "team": "TJE58GTJL",
        "user_team": "TJE58GTJL",
        "source_team": "TJE58GTJL",
        "user_profile": {
            "avatar_hash": "5879d1254678",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-03-20\/1015010058132_5879d1254678f05899b0_72.jpg",
            "first_name": "Emma",
            "real_name": "Emma Siemasko",
            "display_name": "Emma Siemasko",
            "team": "TJE58GTJL",
            "name": "emma",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UJ57DB9BM",
            "ts": "1586021256.000000"
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Nn4f",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Hi all! I have a recommendation for transcription work. I send out a ton of recordings for transcription as I write case studies and blog content from interviews. Normally, I use "
                            },
                            {
                                "type": "link",
                                "url": "http:\/\/Rev.com",
                                "text": "Rev.com"
                            },
                            {
                                "type": "text",
                                "text": " which is an awesome service. However, I have a good friend who does transcription at about the same rate as Rev, and she's a joy! I'll be using her moving forward and highly recommend her to anyone needing transcripts. She's not exactly a \"tool\" but I wasn't sure where else to put this. Her name is Maggie Weber. maggiew at gmail."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UUKNJH6C9"
                ],
                "count": 1
            }
        ]
    }
]